// 1. Як можна оголосити змінну у Javascript?
//Змінну можна оголосити за допомогою ключевих слів: let та const
// 2. У чому різниця між функцією prompt та функцією confirm?
// prompt - відображає модальне вікно з питанням та полем для вводу тексту + двома клавішами ОК/Відміна.
// confirm - відображає модальне вікно з питанням та двома клавішами ОК/Відміна.
// 3. Що таке неявне перетворення типів? Наведіть один приклад.
// Це коли відбувається автоматична зміна типів данних. Приклад: 666 + '' .

// Завдання №1
// const name = "Anton";
// let admin = name;
// console.log(admin);

// Завдання №2
// let days = +prompt("Введыть число від 1 до 10:");
// if (days >= 1 && days <= 10) {
//   dayToSeconds = days * 24 * 60 * 60;
//   console.log(dayToSeconds);
// } else {
//   +prompt("Введыть число від 1 до 10:");
// }

// Завдання №3
// let userValue = prompt("Введіть Ваше значення:");
// console.log(userValue);
