// 1. Описати своїми словами у кілька рядків, навіщо у програмуванні потрібні цикли.
// Завдяки циклам, не потрібно робити однотипні дії декілька разів або повторення написання частини коду декілька разів.
// 2. Опишіть у яких ситуаціях ви використовували той чи інший цикл в JS.
// цикл "for" використовував для перебору чисел від 1 до 10 і в результаті виводив їв в console.log
// цикл "do while" для перевірки правильності введення данних в prompt, та виводу повторного запиту для корректних данних
// 3. Що таке явне та неявне приведення (перетворення) типів даних у JS?
// явне - це коли за допомогою тип данних, ціленаправлено переводимо значення. (Приклад: Number())
// неявне - це коли данні можуть бути конвертовані між між різними типами данних. (Приклад: if (value) {…}
//- value неявно перетворить на тип Boolean)

let userNumber = Number(prompt("Enter your number:"));
while (
  !Boolean(userNumber) ||
  isNaN(userNumber) ||
  !Number.isInteger(userNumber)
) {
  userNumber = Number(prompt("Please, enter your number:"));
}
if (userNumber < 5) {
  console.log("Sorry, no numbers");
} else {
  for (let i = 1; i <= userNumber; i++) {
    if (i % 5 === 0) {
      console.log(i);
    }
  }
}
